Revit 2027 API
ParameterFilterElement.ClearRules Method
 Removes all rules from this filter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void ClearRules()
Public Sub ClearRules
public:
void ClearRules()
member ClearRules : unit -> unit
See Also
Reference
ParameterFilterElement Class
Autodesk.Revit.DB Namespace